### Задание 1

In [5]:
import pandas as pd

In [10]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 
                        'author_name':['Тургенев', 'Чехов', 'Островский']},
        columns = ['author_id', 'author_name'])

In [11]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [14]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                    'book_title': ['Отцы и дети', 'Рудин',
                                   'Дворянское гнездо', 
                                   'Толстый и тонкий', 
                                   'Дама с собачкой', 
                                   'Гроза', 'Таланты и поклонники'],
                    'price': [450, 300, 350, 500, 450, 370, 290]},
                   columns = ['author_id', 'book_title', 'price'])

In [15]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [23]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [28]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [29]:
authors_price['author_name']

0      Тургенев
1      Тургенев
2      Тургенев
3         Чехов
4         Чехов
5    Островский
6    Островский
Name: author_name, dtype: object

### Задание 4

In [43]:
groupby = authors_price.groupby("author_name")

In [56]:
groupby["price"].mean()

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [49]:
groupby.agg({'price': 'max', 'price': 'min'})

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [60]:
authors_stat = pd.DataFrame({
    'mean_price': groupby['price'].mean(),
    'min_price': groupby['price'].min(),
    'max_price': groupby['price'].max(),
    
})
authors_stat

             mean_price  min_price  max_price
author_name
Островский   330.000000        290        370
Тургенев     366.666667        300        450
Чехов        475.000000        450        500